### ***Dataframe :***

1. **Create a dataframe :**

* **Example : Create a dataframe from a dictionary and display it.**

**Sample data: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}**

In [18]:
# Import required library

import pandas as pd

In [19]:
# Create a dataframe from a dictionary and display it

dictionary = {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

df = pd.DataFrame(dictionary)

df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

2. **Access a column :**

**We can access the column "X" and assign it a new dataframe a:**

In [20]:
a = df[["X"]]

In [21]:
a

    X
0  78
1  85
2  96
3  80
4  86

In [22]:
type(a)

pandas.core.frame.DataFrame

**Note :** We can also get a column as a series. We can think of a Pandas series as a 1-D dataframe. Just use one bracket:

In [23]:
b = df["X"]

In [24]:
b

0    78
1    85
2    96
3    80
4    86
Name: X, dtype: int64

In [25]:
type(b)

pandas.core.series.Series

We can do the same thing for multiple columns; we just put the dataframe name, in this case, df, and the name of the multiple column headers enclosed in double brackets. The result is a new dataframe comprised of the specified columns:

In [26]:
df[["X","Z"]]

    X   Z
0  78  86
1  85  97
2  96  96
3  80  72
4  86  83

3. **Access a value :**

One way to access unique elements is the iloc method, where you can access the 1st row and the 1st column as follows:

In [27]:
# Access the value on the first row and the first column
df.iloc[0,0]

78

In [28]:
# Access the value on the second row and the second column
df.iloc[1,1]

94

We can access the column using the name

In [29]:
df.loc[0,"X"]

78

In [30]:
df.loc[1,"Y"]

94

4. **Slicing :**

We can perform slicing using both the index and the name of the column:

In [31]:
# Slicing the dataframe

df.iloc[0:3, 0:2]

    X   Y
0  78  84
1  85  94
2  96  89

In [32]:
# Slicing the dataframe using name

df.loc[0:2, 'X':'Y']

    X   Y
0  78  84
1  85  94
2  96  89